           SELECT EIGENTUM   ASSIGN TO "HV-EIGEN.DAT"
                             ORGANIZATION INDEXED  ACCESS DYNAMIC
                             RECORD KEY EG-KEY
                             ALTERNATE KEY EG-MCODE DUPLICATES
                             FILE STATUS WF-STATUS.
